<template>
	<div class="teacher-agreement">
		<p>甲方：{{body.schoolName}}</p>
		<p>地址：{{body.schoolAddress}}</p>
		<p>负责人：{{body.contacts}}</p>
		<p>乙方： 厦门神州鹰软件科技有限公司</p>
		<p>地址： 厦门市软件园二期望海路51号三楼</p>
		<p>负责人：叶荏芊 </p>
		<br>
		<p>为了方便学生缴纳学费等费用（含学费、伙食费、住宿费等，以下通称“学费”），提高学费缴纳效率，甲、乙双方经共同协商，同意就甲方应收取学生家长的学费通过乙方“掌通家园”APP实现在线收款，签订如下协议：</p>
		<h3>一、 基本原则</h3>
		<p>1、甲方委托乙方利用自身软件优势和优良的服务条件， 协助甲方在线收取学生学费。</p>
		<p>2、甲乙双方遵循国家有关法律、法规、建立业务合作关系，并严格按照双方签订、确认的书面或电子协议履行。</p>
		<h3>二、 合作内容</h3>
		<p>1、甲方在乙方“掌通家园”APP上申请开通学费管理功能，并根据乙方的要求填写相关资料，开通支付宝账户或其他乙方指定的第三方支付平台账号后即可通过乙方“掌通家园”APP上的“学费管理”模块实现在线收取学费功能，所收取的学费将存放于网商银行资金托管账户。甲方指定收款账号发生变更的，应及时向乙方提出书面变更申请。</p>
		<h3>三、 甲方的责任与义务</h3>
		<p>1、甲方应根据“掌通家园”APP上的“学费管理”模块的操作指引完成学费在线收取的申请，并保证所填写资料的真实、完整、正确。</p>
		<p>2、在服务期间，甲方应根据乙方的要求提供乙方所需的一切手续。</p>
		<p>3、{{body.protocolEndTime}}前，乙方不收取甲方任何费用。自{{body.protocolStartTime}}起，甲方同意乙方有权根据市场变化调整平台使用费费率，但应提前15天通知甲方，甲方有权选择关闭学费管理功能。</p>
		<p>4、甲方应确认提供的账户信息准确、无误，若因账户错误等非乙方原因造成的一切责任由甲方自行承担。</p>
		<h3>四、 乙方的责任与义务</h3>
		<p>1、乙方需要提供相应的网络与技术服务支持以便s顺利实现甲方学费在线收取功能。</p>
		<p>2、乙方应按照甲方要求提供优质的服务，加强内部人员管理，有效做好相关的服务工作。</p>
		<p>3、乙方人员不得对外透露甲方各项费用的缴纳标准、学生人数、代收量等信息，并负责保守甲方的所有与此有关的商业秘密。</p>
		<h3>五、 双方责任与义务</h3>
		<p>1、甲方同意并接受乙方收费系统中对代收范围、代收方式和账号管理及责任等事项的各项约定。</p>
		<p>2、对账原则：以第三方支付公司交易流水为对账依据，资金入账户后，乙方根据必要的对账凭证与事先商定的资金管理规则与甲方开具的收款依据进行对账，并将对账结果反馈给甲方，使双方数据一致（ 甲乙双方有专人负责对账）。</p>
		<p>3、由于第三方支付公司技术等方面原因造成的资金延迟到账、结算金额差异等结果，乙方有义务提前通过邮件或电话等方式告知甲方，并尽力协助以保证甲方的资金安全。</p>
		<p>4、乙方需要保证甲方在使用学费在线收取功能期间的资金安全，如果在此期间由于乙方技术等方面原因造成甲方的资金损失，乙方将在法律责任范围内赔偿甲方损失。</p>
		<h3>六、 违约</h3>
		<p>双方承认，任何一方对本协议的任何违反都将给对方造成损失。如果一方违约，遵守协议的另一方有权通过双方商定的争议解决方式获得补偿。</p>
		<h3>七、 争议解决</h3>
		<p>双方因本协议或本协议履行发生的任何争议， 应尽可能先协商解决， 如协商不成，则任何一方有权将争议提交乙方所在地的人民法院进行诉讼。</p>
		<h3>八、 附则</h3>
		<p>1、本协议有效期一年，自双方法定代表人或授权代表签字并加盖公章之日起生效。如有未尽事宜， 经双方协商可签订补充协议。有效期满后，如双方均无提出异议，本协议继续有效。如果由于法律或法规原因导致本协议无法继续实施的，则本协议自动终止。若一方欲终止协议，须提前两个月以书面形式通知对方。</p>
		<p>2、本协议一式两份，双方各执一份，均具有同等效力，且双方应当在协议正本上加盖骑缝章。</p>
		<h3>九、 备注</h3>
		<p>1、本协议自双方授权代表盖章或者签字之日起生效。如甲方通过网络线上点击确认的方式来确认本协议的，则本协议自点击确认之时起生效，且该点击确认行为与甲方加盖公章或者签字的行为具有同等法律效力。</p>
		<p>2、甲方同意，乙方有权随时对本协议进行修改，并在掌通家园APP或以其它公告方式通知乙方。乙方制定、修改的内容一经公布即自动生效，除非公告另行规定生效时间。如甲方继续履行本协议的，则视为甲方接受并同意遵守修改后的内容。</p>
		<br>
		<p>（以下无正文，为各方签署部分）</p>
		<p>甲方：{{body.schoolName}}</p>
		<p>授权代表：{{body.contacts}}</p>
		<p>签约日期：<span>年</span><span>月</span><span>日</span></p>
		<br>
		<p>乙方：厦门神州鹰软件科技有限公司</p>
		<p>授权代表：叶荏芊</p>
		<p>签约日期：<span>年</span><span>月</span><span>日</span></p>
	</div>
</template>

<script>
import {payApi} from '@/api/index'
// import ClientApi from '@/utils/client'

export default {
	name: 'agreement',
	data () {
		return {
			body: {}
		}
	},
	mounted () {
		payApi.teacherApplyInfo().then(res => {
			if (res) {
				this.body = res
			}
		})
	}
}
</script>

<style lang="scss" scoped>
@import '../../../assets/css/parent.scss';
.teacher-agreement {
	padding: 30px;
	font-size: 28px;
	h3 {
		font-weight: normal;
		margin-top: 30px;
		font-size: 32px;
    color: #000;
	}
	p {
		color: #333;
		margin-bottom: 10px;
		span {
			margin-left: 60px;
		}
	}
}
</style>
